package com.example.coursegeo.tests;

public class QuestionAnswer {

    public static String question[] ={
            "Дополните информацию:\n «Город - это населённый пункт, жители которого, как правило, не занимаются сельским хозяйством. Однако не каждый населённый пункт может считаться городом. Так, согласно российским законам, город должен иметь не менее _________»",
            "Дополните информацию:\n «Город - это населённый пункт, жители которого, как правило, не занимаются сельским хозяйством. Однако не каждый населённый пункт может считаться городом. Так, согласно российским законам, город должен иметь не менее 12 тыс. жителей»",
    };

    public static String choices[][] = {
            {"15 тыс. жителей","12 тыс. жителей","10 тыс. жителей","8 тыс. жителей"},
    };

    public static String correctAnswers[] = {
            "ans_B",
            "ans_C",
            "ans_D",
            "ans_B",
            "ans_B"
    };

    public static String question2[] ={
            "Вставьте на свои места определения современных городов. \n Современные города в зависимости от количества жителей делятся на:"
    };

    public static String choices2[][] ={
            {"Большие",
            "Города-миллионеры",
            "Крупные",
            "Крупнейшие",
            "малые",
            "средние",
            "до 50 тыс. жителей",
            "до 50-100 тыс. жителей",
            "до 100-250 тыс. жителей",
            "до 250-500 тыс. жителей",
            "до 500-1 млн жителей",
            "свыше 1 млн жителей"}
    };

    public static String question3[] ={
            "Вставьте пропущенные в тексте слова:\n «В моём городе проживает ______ жителей. Он относится к ______ городам Российской Федерации»",
            "Вставьте пропущенные в тексте слова:\n «В моём городе проживает больше 1 миллиона жителей жителей. Он относится к ______ городам Российской Федерации»",
            "Вставьте пропущенные в тексте слова:\n «В моём городе проживает ______ жителей. Он относится к большим городам Российской Федерации»",
            "Вставьте пропущенные в тексте слова:\n «В моём городе проживает больше 1 миллиона жителей жителей. Он относится к большим городам Российской Федерации»",
    };

    public static String choices3[][] = {
            {"1 миллион","Больше 1 миллиона","Меньше 1 миллиона","Большим","Маленьким","Средним"},
    };
}
